# Area Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisSpace..::..Area Property
EnergyAnalysisSpace Class See Also
---
The area for this space.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double Area { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Area As Double
	Get
```

Visual C++
---
```text
public:
property double Area {
	double get ();
}
```

# Remarks
If the space is created with the mode 'Use Rooms or Spaces', this value is the enclosed area measured by interior bounding surfaces. Otherwise, this value is measured by the center plane of walls and the top plane of roofs and floors.
# See Also
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace